БухЭксп/InformationRegisters/CW_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ВладельцыСтатуса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыДокументов/Forms/ФормаСпискаИстория/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РедактированиеСтатусовДокументов = CW_ПраваДоступа.ПравоДоступно("РедактированиеСтатусовДокументов", ПараметрыСеанса.ТекущийПользователь);
	
	Элементы.СписокУдалить.Видимость 				=  РедактированиеСтатусовДокументов;
	Элементы.СписокКонтекстноеМенюУдалить.Видимость =  РедактированиеСтатусовДокументов;

	Параметры.Свойство("ЗначениеОтбора",ЗначениеОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные 	= Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ПользовательАвторСтатуса(ТекущиеДанные.Автор) Тогда 
			Если Не РедактированиеСтатусовДокументов Тогда
				//Только комментарий
				Отказ = Истина;
				ОписаниеОпвещения = Новый ОписаниеОповещения("ОбработатьИзменениеКомментария",ЭтаФорма, Элементы.Список.ТекущаяСтрока);
				ПоказатьВводСтроки(ОписаниеОпвещения, ТекущиеДанные.Комментарий, "Введите комментарий",,Истина);
			КонецЕсли;
		Иначе
			Отказ = Истина;
			ПоказатьПредупреждение(,"Редактирование статуса запрещено!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные 	= Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ (ПользовательАвторСтатуса(ТекущиеДанные.Автор) и РедактированиеСтатусовДокументов) Тогда
			Отказ 			= Истина;
			ПоказатьПредупреждение(,"Удаление статуса запрещено!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользовательАвторСтатуса(Автор)
	
	Возврат Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеКомментария(Результат, КлючЗаписи) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьИзменениеКомментарияНаСервере(Результат, КлючЗаписи);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеКомментарияНаСервере(Результат, КлючЗаписи)
	
	РегистрыСведений.CW_СтатусыДокументов.ОбновитьКомментарийЗаписиСтатуса(КлючЗаписи, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаСтатусов(Команда)
	
	ТекущиеДанные 				= Элементы.Список.ТекущиеДанные;
	ДокументВМассиве 			= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущиеДанные.Документ);
	ИдентификаторОбъекта 		= ПолучитьИдентификаторОбъекта(ТекущиеДанные.Документ);
	АдресДокументовДляОтбора 	= ПолучитьАдресДокументов(ДокументВМассиве);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторОбъекта", 	ИдентификаторОбъекта);
	ПараметрыФормы.Вставить("АдресДокументовДляОтбора",	АдресДокументовДляОтбора);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", 	Истина);
	
	ОткрытьФорму("Отчет.CW_СтатистикаНахожденияДокументаВСтатусах.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресДокументов(ПараметрКоманды)
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрКоманды);
	
КонецФункции

&НаСервере
Функция ПолучитьИдентификаторОбъекта(Ссылка)
	
	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка));

КонецФункции

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Оповестить("Изменение_СтатусДокумента");

КонецПроцедуры
